; domain
(define (domain block-words)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem block-words)
	(:domain block-words)
	(:objects
		a o h l e c t g n s - block
	)
	(:init
		(handempty)
		(clear h)
		(on h s)
		(on s o)
		(on o a)
		(on a l)
		(ontable l)
		(clear n)
		(on n e)
		(ontable e)
		(clear g)
		(on g c)
		(on c t)
		(ontable t)
	)
	(:goal (and
		;; clone
		(clear c) (ontable e) (on c l) (on l o) (on o n) (on n e)
	))
)

; plan
1. (unstack h s)
   deleted: (clear h) (handempty) (on h s)
   added: (holding h) (clear s)
   goals met: 2 of 6
2. (put-down h)
   deleted: (holding h)
   added: (clear h) (handempty) (ontable h)
   goals met: 2 of 6
3. (unstack s o)
   deleted: (clear s) (handempty) (on s o)
   added: (holding s) (clear o)
   goals met: 2 of 6
4. (stack s h)
   deleted: (holding s) (clear h)
   added: (clear s) (handempty) (on s h)
   goals met: 2 of 6
5. (unstack o a)
   deleted: (clear o) (handempty) (on o a)
   added: (holding o) (clear a)
   goals met: 2 of 6
6. (stack o n)
   deleted: (holding o) (clear n)
   added: (clear o) (handempty) (on o n)
   goals met: 3 of 6
7. (unstack a l)
   deleted: (clear a) (handempty) (on a l)
   added: (holding a) (clear l)
   goals met: 3 of 6
8. (stack a s)
   deleted: (holding a) (clear s)
   added: (clear a) (handempty) (on a s)
   goals met: 3 of 6
9. (pick-up l)
   deleted: (ontable l) (clear l) (handempty)
   added: (holding l)
   goals met: 3 of 6
10. (stack l o)
   deleted: (holding l) (clear o)
   added: (clear l) (handempty) (on l o)
   goals met: 4 of 6
11. (unstack g c)
   deleted: (clear g) (handempty) (on g c)
   added: (holding g) (clear c)
   goals met: 5 of 6
12. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 5 of 6
13. (unstack c t)
   deleted: (clear c) (handempty) (on c t)
   added: (holding c) (clear t)
   goals met: 4 of 6
14. (stack c l)
   deleted: (holding c) (clear l)
   added: (clear c) (handempty) (on c l)
   goals met: 6 of 6
